Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/edc/ATSAMS70J20B.PIC
<?xml version="1.0" encoding="UTF-8" standalone="no"?><edc:PIC xmlns:edc="http://crownking/edc" xmlns:atdf="http://crownking/atdf" xmlns:ltx="http://crownking/ltx" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" atdf:architecture="CORTEX-M7" atdf:family="SAMS" edc:arch="arm32bit" edc:hasfreeze="false" edc:name="ATSAMS70J20B" edc:procid="0x0000" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Power>
    <edc:VDD edc:maxvoltage="3.6" edc:minvoltage="1.62" edc:nominalvoltage="3.300"/>
  </edc:Power>
  <edc:ArchDef edc:desc="arm32bit" edc:name="arm32bit">
    <edc:MemTraits edc:addrinc="0x1" edc:locsize="0x1" edc:wordimpl="0xFFFFFFFF" edc:wordinit="0xFFFFFFFF" edc:wordsafe="0xFFFFFFFF" edc:wordsize="0x4"/>
  </edc:ArchDef>
  <edc:InstructionSet edc:instructionsetid="armv7m"/>
  <edc:InterruptList>
    <edc:Interrupt edc:cname="Reset" edc:desc="Reset Vector, invoked on Power up and warm reset" edc:irq="-15"/>
    <edc:Interrupt edc:cname="NonMaskableInt" edc:desc="Non maskable Interrupt, cannot be stopped or preempted" edc:irq="-14"/>
    <edc:Interrupt edc:cname="HardFault" edc:desc="Hard Fault, all classes of Fault" edc:irq="-13"/>
    <edc:Interrupt edc:cname="MemoryManagement" edc:desc="Memory Management, MPU mismatch, including Access Violation and No Match" edc:irq="-12"/>
    <edc:Interrupt edc:cname="BusFault" edc:desc="Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault" edc:irq="-11"/>
    <edc:Interrupt edc:cname="UsageFault" edc:desc="Usage Fault, i.e. Undef Instruction, Illegal State Transition" edc:irq="-10"/>
    <edc:Interrupt edc:cname="SVCall" edc:desc="System Service Call via SVC instruction" edc:irq="-5"/>
    <edc:Interrupt edc:cname="DebugMonitor" edc:desc="Debug Monitor" edc:irq="-4"/>
    <edc:Interrupt edc:cname="PendSV" edc:desc="Pendable request for system service" edc:irq="-2"/>
    <edc:Interrupt edc:cname="SysTick" edc:desc="System Tick Timer" edc:irq="-1"/>
    <edc:Interrupt edc:cname="SUPC" edc:desc="Supply Controller" edc:irq="0"/>
    <edc:Interrupt edc:cname="RSTC" edc:desc="Reset Controller" edc:irq="1"/>
    <edc:Interrupt edc:cname="RTC" edc:desc="Real Time Clock" edc:irq="2"/>
    <edc:Interrupt edc:cname="RTT" edc:desc="Real Time Timer" edc:irq="3"/>
    <edc:Interrupt edc:cname="WDT" edc:desc="Watchdog Timer" edc:irq="4"/>
    <edc:Interrupt edc:cname="PMC" edc:desc="Power Management Controller" edc:irq="5"/>
    <edc:Interrupt edc:cname="EFC" edc:desc="Enhanced Embedded Flash Controller" edc:irq="6"/>
    <edc:Interrupt edc:cname="UART0" edc:desc="UART 0" edc:irq="7"/>
    <edc:Interrupt edc:cname="UART1" edc:desc="UART 1" edc:irq="8"/>
    <edc:Interrupt edc:cname="PIOA" edc:desc="Parallel I/O Controller A" edc:irq="10"/>
    <edc:Interrupt edc:cname="PIOB" edc:desc="Parallel I/O Controller B" edc:irq="11"/>
    <edc:Interrupt edc:cname="USART0" edc:desc="USART 0" edc:irq="13"/>
    <edc:Interrupt edc:cname="USART1" edc:desc="USART 1" edc:irq="14"/>
    <edc:Interrupt edc:cname="PIOD" edc:desc="Parallel I/O Controller D" edc:irq="16"/>
    <edc:Interrupt edc:cname="TWIHS0" edc:desc="Two Wire Interface 0 HS" edc:irq="19"/>
    <edc:Interrupt edc:cname="TWIHS1" edc:desc="Two Wire Interface 1 HS" edc:irq="20"/>
    <edc:Interrupt edc:cname="SSC" edc:desc="Synchronous Serial Controller" edc:irq="22"/>
    <edc:Interrupt edc:cname="TC0" edc:desc="Timer/Counter 0" edc:irq="23"/>
    <edc:Interrupt edc:cname="TC1" edc:desc="Timer/Counter 1" edc:irq="24"/>
    <edc:Interrupt edc:cname="TC2" edc:desc="Timer/Counter 2" edc:irq="25"/>
    <edc:Interrupt edc:cname="AFEC0" edc:desc="Analog Front End 0" edc:irq="29"/>
    <edc:Interrupt edc:cname="DACC" edc:desc="Digital To Analog Converter" edc:irq="30"/>
    <edc:Interrupt edc:cname="PWM0" edc:desc="Pulse Width Modulation 0" edc:irq="31"/>
    <edc:Interrupt edc:cname="ICM" edc:desc="Integrity Check Monitor" edc:irq="32"/>
    <edc:Interrupt edc:cname="ACC" edc:desc="Analog Comparator" edc:irq="33"/>
    <edc:Interrupt edc:cname="USBHS" edc:desc="USB Host / Device Controller" edc:irq="34"/>
    <edc:Interrupt edc:cname="AFEC1" edc:desc="Analog Front End 1" edc:irq="40"/>
    <edc:Interrupt edc:cname="QSPI" edc:desc="Quad I/O Serial Peripheral Interface" edc:irq="43"/>
    <edc:Interrupt edc:cname="UART2" edc:desc="UART 2" edc:irq="44"/>
    <edc:Interrupt edc:cname="TC9" edc:desc="Timer/Counter 9" edc:irq="50"/>
    <edc:Interrupt edc:cname="TC10" edc:desc="Timer/Counter 10" edc:irq="51"/>
    <edc:Interrupt edc:cname="TC11" edc:desc="Timer/Counter 11" edc:irq="52"/>
    <edc:Interrupt edc:cname="AES" edc:desc="AES" edc:irq="56"/>
    <edc:Interrupt edc:cname="TRNG" edc:desc="True Random Generator" edc:irq="57"/>
    <edc:Interrupt edc:cname="XDMAC" edc:desc="DMA" edc:irq="58"/>
    <edc:Interrupt edc:cname="ISI" edc:desc="Camera Interface" edc:irq="59"/>
    <edc:Interrupt edc:cname="PWM1" edc:desc="Pulse Width Modulation 1" edc:irq="60"/>
    <edc:Interrupt edc:cname="FPU" edc:desc="Floating Point Unit" edc:irq="61"/>
    <edc:Interrupt edc:cname="RSWDT" edc:desc="Reinforced Secure Watchdog Timer" edc:irq="63"/>
    <edc:Interrupt edc:cname="CCW" edc:desc="Cache ECC Warning" edc:irq="64"/>
    <edc:Interrupt edc:cname="CCF" edc:desc="Cache ECC Fault" edc:irq="65"/>
    <edc:Interrupt edc:cname="IXC" edc:desc="Floating Point Unit IXC" edc:irq="68"/>
  </edc:InterruptList>
  <edc:PhysicalSpace>
    <edc:NMMRPlace edc:regionid="corenmmrs">
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R0" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="0" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R1" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="4" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R2" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="8" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R3" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="12" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R4" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="16" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R5" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="20" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R6" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="24" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R7" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="28" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R8" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="32" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R9" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="36" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R10" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="40" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R11" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="44" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="R12" edc:desc="General-Purpose Register" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="48" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SP" edc:desc="Stack Pointer" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="52" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MSP" edc:desc="Main Stack Pointer" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="64" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PSP" edc:desc="Process Stack Pointer" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="68" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="LR" edc:desc="Link Register" edc:impl="0xFFFFFFFF" edc:mclr="11111111111111111111111111111111" edc:nmmrid="56" edc:nzwidth="0x20" edc:por="11111111111111111111111111111111"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PC" edc:desc="Program Counter" edc:impl="0xFFFFFFFF" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:nmmrid="60" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnnnnn--------nnnnnn-nnnnnnnnn" edc:cname="PSR" edc:desc="Program Status Register" edc:impl="0xFF00FDFF" edc:mclr="00000001000000000000000000000000" edc:nmmrid="72" edc:nzwidth="0x20" edc:por="00000001000000000000000000000000"/>
      <edc:SFRDef edc:access="nnnnn-------nnnn----------------" edc:cname="APSR" edc:desc="Application Program Status Register" edc:impl="0xF80F0000" edc:mclr="00000000000000000000000000000000" edc:nmmrid="76" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="-----------------------rrrrrrrrr" edc:cname="IPSR" edc:desc="Interrupt Program Status Register" edc:impl="0x1FF" edc:mclr="00000000000000000000000000000000" edc:nmmrid="80" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="-----rrr--------rrrrrr----------" edc:cname="EPSR" edc:desc="Execution Program Status Register" edc:impl="0x700FC00" edc:mclr="00000001000000000000000000000000" edc:nmmrid="84" edc:nzwidth="0x20" edc:por="00000001000000000000000000000000"/>
      <edc:SFRDef edc:access="-------------------------------n" edc:cname="PRIMASK" edc:desc="Priority Mask Register" edc:impl="0x1" edc:mclr="00000000000000000000000000000000" edc:nmmrid="88" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="-------------------------------n" edc:cname="FAULTMASK" edc:desc="Fault Mask Register" edc:impl="0x1" edc:mclr="00000000000000000000000000000000" edc:nmmrid="92" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="------------------------nnnnnnnn" edc:cname="BASEPRI" edc:desc="Base Priority Mask Register" edc:impl="0xFF" edc:mclr="00000000000000000000000000000000" edc:nmmrid="96" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:access="-----------------------------nnn" edc:cname="CONTROL" edc:desc="Control Register" edc:impl="0x7" edc:mclr="00000000000000000000000000000000" edc:nmmrid="100" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
    </edc:NMMRPlace>
    <edc:SFRDataSector edc:beginaddr="0x40000000" edc:endaddr="0x400E1AE8" edc:regionid="PERIPHERALS">
      <edc:AdjustPoint edc:_addr="0x40000000" edc:offset="0x4000"/>
      <edc:SFRDef edc:_addr="0x40004000" edc:access="----------------w-----ww------ww" edc:cname="SSC_CR" edc:nzwidth="0x20" ltx:memberofperipheral="SSC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXEN" edc:desc="Receive Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXDIS" edc:desc="Receive Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:desc="Transmit Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXDIS" edc:desc="Transmit Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40004004" edc:access="--------------------nnnnnnnnnnnn" edc:cname="SSC_CMR" edc:nzwidth="0x20" ltx:memberofperipheral="SSC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DIV" edc:desc="Clock Divider" edc:nzwidth="0xC"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40004008" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x40004010" edc:access="nnnnnnnnnnnnnnnn---nnnnnnnnnnnnn" edc:cname="SSC_RCMR" edc:nzwidth="0x20" ltx:memberofperipheral="SSC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CKS" edc:desc="Receive Clock Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Divided Clock" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TK" edc:desc="TK Clock signal" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="RK" edc:desc="RK pin" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CKO" edc:desc="Receive Clock Output Mode Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="None, RK pin is an input" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CONTINUOUS" edc:desc="Continuous Receive Clock, RK pin is an output" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="TRANSFER" edc:desc="Receive Clock only during data transfers, RK pin is an output" edc:when="(field &amp; 0x7) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CKI" edc:desc="Receive Clock Inversion" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CKG" edc:desc="Receive Clock Gating Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="CONTINUOUS" edc:desc="None" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="EN_RF_LOW" edc:desc="Receive Clock enabled only if RF Low" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="EN_RF_HIGH" edc:desc="Receive Clock enabled only if RF High" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="START" edc:desc="Receive Start Selection" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="CONTINUOUS" edc:desc="Continuous, as soon as the receiver is enabled, and immediately after the end of transfer of the previous data." edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TRANSMIT" edc:desc="Transmit start" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="RF_LOW" edc:desc="Detection of a low level on RF signal" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="RF_HIGH" edc:desc="Detection of a high level on RF signal" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="RF_FALLING" edc:desc="Detection of a falling edge on RF signal" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="RF_RISING" edc:desc="Detection of a rising edge on RF signal" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="RF_LEVEL" edc:desc="Detection of any level change on RF signal" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="RF_EDGE" edc:desc="Detection of any edge on RF signal" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="CMP_0" edc:desc="Compare 0" edc:when="(field &amp; 0xF) == 0x8"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STOP" edc:desc="Receive Stop Selection" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="STTDLY" edc:desc="Receive Start Delay" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PERIOD" edc:desc="Receive Period Divider Selection" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
