Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/edc/ATSAMS70J20B.PIC
      <edc:SFRDef edc:_addr="0x40024060" edc:access="--------nnnnnnnn----------nnnnnn" edc:cname="US_LONMR" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="COMMT" edc:desc="LON comm_type Parameter Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COLDET" edc:desc="LON Collision Detection Feature" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOL" edc:desc="Terminate Frame upon Collision Notification" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CDTAIL" edc:desc="LON Collision Detection on Frame Tail" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMAM" edc:desc="LON DMA Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LCDS" edc:desc="LON Collision Detection Source" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="EOFS" edc:desc="End of Frame Condition Size" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024064" edc:access="------------------nnnnnnnnnnnnnn" edc:cname="US_LONPR" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LONPL" edc:desc="LON Preamble Length" edc:nzwidth="0xE"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024068" edc:access="------------------------nnnnnnnn" edc:cname="US_LONDL" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LONDL" edc:desc="LON Data Length" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002406C" edc:access="------------------------nnnnnnnn" edc:cname="US_LONL2HDR" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLI" edc:desc="LON Backlog Increment" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="ALTP" edc:desc="LON Alternate Path Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PB" edc:desc="LON Priority Bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024070" edc:access="--------------------------rrrrrr" edc:cname="US_LONBL" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LONBL" edc:desc="LON Node Backlog Value" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024074" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="US_LONB1TX" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BETA1TX" edc:desc="LON Beta1 Length after Transmission" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024078" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="US_LONB1RX" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BETA1RX" edc:desc="LON Beta1 Length after Reception" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002407C" edc:access="-----------------nnnnnnn-nnnnnnn" edc:cname="US_LONPRIO" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PSNB" edc:desc="LON Priority Slot Number" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NPS" edc:desc="LON Node Priority Slot" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024080" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="US_IDTTX" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IDTTX" edc:desc="LON Indeterminate Time after Transmission (comm_type = 1 mode only)" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024084" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="US_IDTRX" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IDTRX" edc:desc="LON Indeterminate Time after Reception (comm_type = 1 mode only)" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024088" edc:access="----------------------------nnnn" edc:cname="US_ICDIFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ICDIFF" edc:desc="IC Differentiator Number" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4002408C" edc:offset="0x58"/>
      <edc:SFRDef edc:_addr="0x400240E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="US_WPMR" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x555341"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400240E8" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:cname="US_WPSR" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protection Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protection Violation Source" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400240EC" edc:offset="0x3F14"/>
      <edc:SFRDef edc:_addr="0x40028000" edc:access="----------wwwwwwwwwwwwwwwwwwww--" edc:cname="US_CR" edc:nzwidth="0x20" ltx:memberofperipheral="USART1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RSTRX" edc:desc="Reset Receiver" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTTX" edc:desc="Reset Transmitter" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXEN" edc:desc="Receiver Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXDIS" edc:desc="Receiver Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:desc="Transmitter Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXDIS" edc:desc="Transmitter Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTSTA" edc:desc="Reset Status Bits" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STTBRK" edc:desc="Start Break" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STPBRK" edc:desc="Stop Break" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STTTO" edc:desc="Clear TIMEOUT Flag and Start Time-out After Next Character Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SENDA" edc:desc="Send Address" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTIT" edc:desc="Reset Iterations" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTNACK" edc:desc="Reset Non Acknowledge" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RETTO" edc:desc="Start Time-out Immediately" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTREN" edc:desc="Data Terminal Ready Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTRDIS" edc:desc="Data Terminal Ready Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTSEN" edc:desc="Request to Send Pin Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTSDIS" edc:desc="Request to Send Pin Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINABT" edc:desc="Abort LIN Transmission" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINWKUP" edc:desc="Send LIN Wakeup Signal" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
