Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/edc/ATSAMS70J20B.PIC
      <edc:AdjustPoint edc:_addr="0x400E0AE8" edc:offset="0x118"/>
      <edc:SFRDef edc:_addr="0x400E0C00" edc:access="-----n---------n----nnnn-------n" edc:cname="EEFC_FMR" edc:nzwidth="0x20" ltx:memberofperipheral="EFC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FRDY" edc:desc="Flash Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="FWS" edc:desc="Flash Wait State" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SCOD" edc:desc="Sequential Code Optimization Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="CLOE" edc:desc="Code Loop Optimization Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0C04" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="EEFC_FCR" edc:nzwidth="0x20" ltx:memberofperipheral="EFC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FCMD" edc:desc="Flash Command" edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="GETD" edc:desc="Get Flash descriptor" edc:when="(field &amp; 0xFF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="WP" edc:desc="Write page" edc:when="(field &amp; 0xFF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="WPL" edc:desc="Write page and lock" edc:when="(field &amp; 0xFF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="EWP" edc:desc="Erase page and write page" edc:when="(field &amp; 0xFF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="EWPL" edc:desc="Erase page and write page then lock" edc:when="(field &amp; 0xFF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="EA" edc:desc="Erase all" edc:when="(field &amp; 0xFF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="EPA" edc:desc="Erase pages" edc:when="(field &amp; 0xFF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="SLB" edc:desc="Set lock bit" edc:when="(field &amp; 0xFF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="CLB" edc:desc="Clear lock bit" edc:when="(field &amp; 0xFF) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="GLB" edc:desc="Get lock bit" edc:when="(field &amp; 0xFF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="SGPB" edc:desc="Set GPNVM bit" edc:when="(field &amp; 0xFF) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="CGPB" edc:desc="Clear GPNVM bit" edc:when="(field &amp; 0xFF) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="GGPB" edc:desc="Get GPNVM bit" edc:when="(field &amp; 0xFF) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="STUI" edc:desc="Start read unique identifier" edc:when="(field &amp; 0xFF) == 0x0E"/>
              <edc:SFRFieldSemantic edc:cname="SPUI" edc:desc="Stop read unique identifier" edc:when="(field &amp; 0xFF) == 0x0F"/>
              <edc:SFRFieldSemantic edc:cname="GCALB" edc:desc="Get CALIB bit" edc:when="(field &amp; 0xFF) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="ES" edc:desc="Erase sector" edc:when="(field &amp; 0xFF) == 0x11"/>
              <edc:SFRFieldSemantic edc:cname="WUS" edc:desc="Write user signature" edc:when="(field &amp; 0xFF) == 0x12"/>
              <edc:SFRFieldSemantic edc:cname="EUS" edc:desc="Erase user signature" edc:when="(field &amp; 0xFF) == 0x13"/>
              <edc:SFRFieldSemantic edc:cname="STUS" edc:desc="Start read user signature" edc:when="(field &amp; 0xFF) == 0x14"/>
              <edc:SFRFieldSemantic edc:cname="SPUS" edc:desc="Stop read user signature" edc:when="(field &amp; 0xFF) == 0x15"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FARG" edc:desc="Flash Command Argument" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="FKEY" edc:desc="Flash Writing Protection Key" edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="The 0x5A value enables the command defined by the bits of the register. If the field is written with a different value, the write is not performed and no action is started." edc:when="(field &amp; 0xFF) == 0x5A"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0C08" edc:access="------------rrrr------------rrrr" edc:cname="EEFC_FSR" edc:nzwidth="0x20" ltx:memberofperipheral="EFC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FRDY" edc:desc="Flash Ready Status (cleared when Flash is busy)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCMDE" edc:desc="Flash Command Error Status (cleared on read or by writing EEFC_FCR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLOCKE" edc:desc="Flash Lock Error Status (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLERR" edc:desc="Flash Error Status (cleared when a programming operation starts)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="UECCELSB" edc:desc="Unique ECC Error on LSB Part of the Memory Flash Data Bus (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MECCELSB" edc:desc="Multiple ECC Error on LSB Part of the Memory Flash Data Bus (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UECCEMSB" edc:desc="Unique ECC Error on MSB Part of the Memory Flash Data Bus (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MECCEMSB" edc:desc="Multiple ECC Error on MSB Part of the Memory Flash Data Bus (cleared on read)" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0C0C" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="EEFC_FRR" edc:nzwidth="0x20" ltx:memberofperipheral="EFC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FVALUE" edc:desc="Flash Result Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E0C10" edc:offset="0xD4"/>
      <edc:SFRDef edc:_addr="0x400E0CE4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="EEFC_WPMR" edc:nzwidth="0x20" ltx:memberofperipheral="EFC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x454643"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E0CE8" edc:offset="0x118"/>
      <edc:SFRDef edc:_addr="0x400E0E00" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PIOA_PER" edc:nzwidth="0x20" ltx:memberofperipheral="PIOA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="P0" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P1" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P2" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P3" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P4" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P5" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P6" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P7" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P8" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P9" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P10" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P11" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P12" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P13" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P14" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P15" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P16" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P17" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P18" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P19" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P20" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P21" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P22" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P23" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P24" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P25" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P26" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P27" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P28" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P29" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P30" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P31" edc:desc="PIO Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0E04" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PIOA_PDR" edc:nzwidth="0x20" ltx:memberofperipheral="PIOA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="P0" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P1" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P2" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P3" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P4" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P5" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P6" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P7" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P8" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P9" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P10" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P11" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P12" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P13" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P14" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P15" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P16" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P17" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P18" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P19" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P20" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P21" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P22" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P23" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P24" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P25" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P26" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P27" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P28" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P29" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P30" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="P31" edc:desc="PIO Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
