Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/edc/ATSAMS70J20B.PIC
      <edc:SFRDef edc:_addr="0x400E1880" edc:access="--------------------------wwwwww" edc:cname="RTC_IER" edc:nzwidth="0x20" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ACKEN" edc:desc="Acknowledge Update Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ALREN" edc:desc="Alarm Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SECEN" edc:desc="Second Event Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEN" edc:desc="Time Event Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CALEN" edc:desc="Calendar Event Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TDERREN" edc:desc="Time and/or Date Error Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1884" edc:access="--------------------------wwwwww" edc:cname="RTC_IDR" edc:nzwidth="0x20" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ACKDIS" edc:desc="Acknowledge Update Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ALRDIS" edc:desc="Alarm Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SECDIS" edc:desc="Second Event Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMDIS" edc:desc="Time Event Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CALDIS" edc:desc="Calendar Event Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TDERRDIS" edc:desc="Time and/or Date Error Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1888" edc:access="--------------------------rrrrrr" edc:cname="RTC_IMR" edc:nzwidth="0x20" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ACK" edc:desc="Acknowledge Update Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ALR" edc:desc="Alarm Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SEC" edc:desc="Second Event Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIM" edc:desc="Time Event Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAL" edc:desc="Calendar Event Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TDERR" edc:desc="Time and/or Date Error Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E188C" edc:access="----------------------------rrrr" edc:cname="RTC_VER" edc:nzwidth="0x20" ltx:memberofperipheral="RTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVTIM" edc:desc="Non-valid Time" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVCAL" edc:desc="Non-valid Calendar" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVTIMALR" edc:desc="Non-valid Time Alarm" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVCALALR" edc:desc="Non-valid Calendar Alarm" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1890" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SYS_GPBR0" edc:nzwidth="0x20" ltx:memberofperipheral="GPBR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GPBR_VALUE" edc:desc="Value of GPBR x" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1894" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SYS_GPBR1" edc:nzwidth="0x20" ltx:memberofperipheral="GPBR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GPBR_VALUE" edc:desc="Value of GPBR x" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E1898" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SYS_GPBR2" edc:nzwidth="0x20" ltx:memberofperipheral="GPBR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GPBR_VALUE" edc:desc="Value of GPBR x" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E189C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SYS_GPBR3" edc:nzwidth="0x20" ltx:memberofperipheral="GPBR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GPBR_VALUE" edc:desc="Value of GPBR x" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E18A0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SYS_GPBR4" edc:nzwidth="0x20" ltx:memberofperipheral="GPBR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GPBR_VALUE" edc:desc="Value of GPBR x" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E18A4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SYS_GPBR5" edc:nzwidth="0x20" ltx:memberofperipheral="GPBR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GPBR_VALUE" edc:desc="Value of GPBR x" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E18A8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SYS_GPBR6" edc:nzwidth="0x20" ltx:memberofperipheral="GPBR">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GPBR_VALUE" edc:desc="Value of GPBR x" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
